Repository: JoseFernandes15/Portfolio
Catalog: locales/*/LC_MESSAGES/texto.po
Languages: pt_pt

# inicio
source: Home
pt_pt: Início

# competencias
source: Skills
pt_pt: Competências

# responsividade
source: Mobile Devices
pt_pt: Responsividade

# projetos
source: Projects
pt_pt: Projetos

# sobre
source: I am a Full-Stack developer with 2 years of experience in webpages and applications development. My goal is developing functional and efficient solutions that positively impact people's lives.
pt_pt: Sou um desenvolvedor Full-Stack com 2 anos de experiência no desenvolvimento de páginas e aplicações Web.<br> Tenho como objetivo criar soluções funcionais e eficientes que impactem positivamente na vida das pessoas.

# btn_sobre
source: Know more
pt_pt: Saber mais

# competencias_texto
source: As a Full-Stack developer, I am involved in the entire development process, from planning to publishing the website.
pt_pt: Como desenvolvedor Full Stack, posso estar envolvido em todo o processo de desenvolvimento, desde o planeamento até à publicação do website.

# bd
source: DATABASE
pt_pt: BASE DE DADOS

# front
source: FRONT-END DEVELOPMENT
pt_pt: DESENVOLVIMENTO FRONT-END

# back
source: BACK-END DEVELOPMENT
pt_pt: DESENVOLVIMENTO BACK-END

# db_text
source: I am capable of creating customizable databases by gathering specific requirements from clients during meetings.
pt_pt: Consigo desenvoler bases de dados personalizadas com base nos requisitos recolhidos em reuniões com o cliente.

# front_text
source: I can create the user interface in multiple programming languages, allowing me to select the most suitable one for each project.
pt_pt: Consigo desenvolver a interface do utilizador, em várias linguagens. Podendo escolher a mais indicada para cada projeto.

# back_text
source: I can create the internal logic of the application in multiple programming languages, allowing me to select the most suitable one for each project.
pt_pt: Consigo desenvolver a lógica interna da aplicação em várias linguagens. Podendo escolher a mais indicada para cada projeto.

# btn_saber_mais
source: Know more
pt_pt: Saber mais

# btn_ver_tudo
source: View All
pt_pt: Ver Tudo

# sobre_titulo
source: About
pt_pt: Sobre

# mim_titulo
source: Me
pt_pt: Mim

# sobremim_h2
source: My name is José Pedro Sampaio Fernandes. I am 20 years old. I was born and live in Guimarães, Portugal.
pt_pt: Chamo-me José Pedro Sampaio Fernandes. Tenho 19 anos. Nasci e vivo em Guimarães, Portugal.

# sobremim_p1
source: In 2019, I began the Technical Programming and Management of Computer Systems Course at Escola Secundária Francisco de Holanda.
pt_pt: Em 2019, comecei a frequentar Curso Técnico de programação e gestão de sistemas informáticos da Escola Secundária Francisco de Holanda.

# sobremim_p2
source: In 2020, I began learning web development and creating web pages using HTML, CSS, and JavaScript.
pt_pt: Em 2020, comecei a estudar programação web e a desenvolver páginas web com HTML, CSS e Javascript.

# sobremim_p3
source: In 2021, I created my first web application, where I developed a database, a user interface, and the application's internal logic.
pt_pt: Em 2021, concluí minha primeira aplicação web, onde desenvolvi uma base de dados, a interface do utilizador e a lógica interna da aplicação.

# sobremim_p4
source: In 2022, I was in my final year of the Technical Programming and Management of Computer Systems course.
pt_pt: Em 2022, estava no último ano do curso técnico de programação e gestão de sistemas informáticos.

# sobremim_p5
source: As part of the course requirements, I needed to take the Professional Aptitude Test (PAP). I reached an agreement with Casual Design, a company, to develop a web page containing information about the company and a web application for internal management.
pt_pt: Com a necessidade de realizar a PAP (Prova de Aptidão Profissional), cheguei a um acordo com a empresa Casual Design para desenvolver uma página web com informações da empresa e uma aplicação web para gestão interna.

# sobremim_p6
source: This project was well received by the company and earned me a score of 19 out of 20 during the PAP presentation.
pt_pt: Este projeto além de ser bem recebido pela empresa, garantiu-me uma nota de 19 valores (0 a 20) na apresentação da PAP.

# sobremim_p7
source: In the same year, as part of the course requirements, I completed an internship where I had the opportunity to learn the AngularJS framework, Node, and Restful APIs.
pt_pt: Ainda no mesmo ano, realizei um estágio (formação em contexto de trabalho) onde tive a oportunidade de aprender a framework AngularJS, Node e APIs Restful.

# sobremim_p8
source: It was a great experience that introduced me to the professional world and helped me develop responsibility.
pt_pt: Foi uma ótima experiência que me fez ganhar responsabilidade e introduziu-me ao "mundo do trabalho".

# sobremim_p9
source: At this stage of my formation, I was assigned 18 out of 20 values.
pt_pt: Nesta etapa da minha formação foram-me atribuidos 18 valores (0 a 20).

# sobremim_p10
source: After interning, the course was completed with an average of 16 points out of 20 and I received a Level 4 qualification on the European Qualifications Framework (EQF).
pt_pt: Após estagiar, o curso foi concluído com média de 16 valores (0 a 20) e foi me garantido o nível 4 de qualificação do Quadro Nacional de Qualificações e do Quadro Europeu de Qualificações.

# sobremim_p11
source: In 2023, I began attending the Higher Professional Technical Course (CTeSP) in Web Development and Multimedia at the Instituto Politécnico do Cávado e do Ave (IPCA).
pt_pt: Em 2023 comecei a frequentar o Curso Técnico Superior Profissional (CTeSP) em Desenvolvimento Web e Multimédia do Institudo Politécnico do Cávado e do Ave (IPCA).

# sobremim_p12
source: Since then, I have gained knowledge and practical experience in various concepts, methodologies, and frameworks related to web development.
pt_pt: Desde então tenho aprendido e posto em prática vários conceitos, metedologias e frameworks.

# projetos_text1
source: My projects are not available yet!
pt_pt: Os meus projetos ainda não estão disponíveis online!

# projetos_text2
source: I'm currently configuring the servers and domains for the projects to become available!
pt_pt: Estou neste momento a configurar os servidores e domínios para estes ficarem disponíveis!

# contacto
source: Contact <span>Me</span>
pt_pt: Contacto

# email
source: Email Address
pt_pt: Endereço Email

# email_h2
source: Send me a mail:
pt_pt: Envie-me um email:

# mensagem
source: Message
pt_pt: Mensagem

# btn_contacto
source: Send
pt_pt: Enviar

# btn_voltar
source: Return
pt_pt: Voltar

# responsividade_texto
source: Try my website on mobile devices!
pt_pt: Teste o website em dispositivos móveis!

# project_p1
source: My projects are not available yet!
pt_pt: Os meus projetos ainda não estão disponíveis online!

# project_p2
source: I'm currently configuring the servers and domains for the projects to become available!
pt_pt: Estou neste momento a configurar os servidores e domínios para estes ficarem disponíveis!

source: Page Not Found
pt_pt: Página não encontrada

# btn_home
source: Home Page
pt_pt: Página Inicial
